import React, { useState } from 'react';
import { Accordion } from 'react-bootstrap';
import ugijk  from "../Images/i.png";





const Bhaluka_Upazila = () => {
  const [activeKey, setActiveKey] = useState(null);

  const faqItems = [
    {
      question: 'অবস্থান, যোগাযোগ ও প্রশাসনিক এলাকা',
      answer: `
        <p><strong>অবস্থান:</strong> 
        ভালুকাকে ময়মনসিংহের দরজা বলা হয়। ঢাকা থেকে ঢাকা-ময়মনসিংহ জাতীয় চারলেন মহাসড়ক পথে রাজেন্দ্রপুর সেনানিবাস (গাজীপুর) ও মাওনা চৌরাস্তা (শ্রীপুর) হয়ে (প্রায় ৭০কিঃমিঃ) পর ভালুকা উপজেলা। উত্তরে ত্রিশাল উপজেলা, দক্ষিণে গাজীপুর জেলার শ্রীপুর উপজেলা, পূর্বে গফরগাঁও উপজেলা, পশ্চিমে ফুলবাড়ীয়া উপজেলা ও টাঙ্গাইল জেলার সখিপুর উপজেলা ও ঘাটাইল উপজেলা।</p>
        
        <p><strong>যোগাযোগ:</strong> 
        ঢাকা থেকে ৭০ কি.মি. দূরত্বে অবস্থিত শিল্পনগরী ভালুকা। চার লেন ঢাকা-ময়মনসিংহ মহাসড়ক দ্বারা খুব সহজেই ভালুকায় পৌঁছানো যায়।</p>
        
        <p><strong>ইতিহাস:</strong> 
        ভালুকা উপজেলা ১৯৮৩ সালে প্রতিষ্ঠিত হয়। ভালুকা উপজেলার আয়তন ৪৪৪.০৫ বর্গ কিলোমিটার। এ উপজেলায় বর্তমানে ১টি পৌরসভা ও ১১টি ইউনিয়ন রয়েছে। সম্পূর্ণ উপজেলার প্রশাসনিক কার্যক্রম ভালুকা থানার আওতাধীন।</p>
        
        <p><strong>পৌরসভা:</strong> ভালুকা</p>
        <p><strong>ইউনিয়নসমূহ:</strong> ১নং উথুরা, ২নং মেদুয়ারী, ৩নং ভরাডোবা, ৪নং ধীতপুর, ৫নং বিরুনিয়া, ৬নং ভালুকা, ৭নং মল্লিকবাড়ী, ৮নং ডাকাতিয়া, ৯নং কাচিনা, ১০নং হবিরবাড়ী, ১১নং রাজ।</p>
      `
    },

    { 
        question: 'ভালুকা নামকরণের ইতিহাস', 
        answer: `মূলত ভালুকা গ্রাম ও ভালুকা বাজারকে কেন্দ্র করেই ভালুকা থানা ও ভালুকা উপজেলার নামকরণ করা হয়েছে। 
          ভালুকা নামকরণের বিষয়ে বেশ কয়েকটি জনশ্রুতি প্রচলিত রয়েছে। এই জনশ্রুতিগুলোর মধ্যে তিনটি জনশ্রুতিই 
          সবচেয়ে বেশি উল্লেখযোগ্য। 

          <p><strong>প্রথম জনশ্রুতি:</strong> 
            এই তিনটি জনশ্রুতির একটি হলো ব্রিটিশ শাসন যখন বাংলাদেশে পাকাপোক্তভাবে প্রতিষ্ঠিত হয়, তখন 
            নীলকর সাহেবগণ তাঁদের নিজস্বার্থ চরিতার্থ করার জন্যে বিভিন্ন জায়গায় নীলকুঠি স্থাপন করেন। 
            নীলকুঠি স্থাপনের পর নীলকর সাহেবগণ মাঝে মধ্যে শিকার করতে বের হতেন। শিকার করতে বের হয়ে 
            নীলকর সাহেবগণ বনে-জঙ্গলে বাঘ, ভাল্লুক দেখতে পেতেন। আর এ কারণেই নীলকর সাহেবদের কাছে 
            এই এলাকা ভাল্লুক এলাকা হিসেবে পরিচিতি পেয়ে যায়। পরবর্তী সময়ে ভাল্লুক এর অপভ্রংশ হিসেবে 
            উৎপত্তি ঘটে ভালুকা নামের।
          </p>

          <p><strong>দ্বিতীয় জনশ্রুতি:</strong> 
            বর্তমান ভালুকা বাজারের দু’টি অংশ রয়েছে। এর একটি হচ্ছে পূর্ব অংশ, অন্যটি হচ্ছে পশ্চিমাংশ। 
            পূর্ববাজারসহ গোটা ভালুকাই ছিলো ভাওয়াল পরগণার অন্তর্ভুক্ত। অবশ্য ভালুকার পশ্চিম বাজার ছিলো 
            মুক্তাগাছার জমিদার মহারাজ শশীকান্তের জমিদারির আওতাভূক্ত। সেখানে জঙ্গলের ভেতর একটি মাজার ছিলো। 
            এর খাদেম ছিলেন ওয়াহেদ আলী ফকির ও তৈয়বজান বিবির পিতা বুচাই ফকির। মরহুম খান সাহেব আবদুল্লাহ 
            চৌধুরীর নির্দেশে তাঁর সমসাময়িক বেশ ক’জন বিশ্বস্ত লোক মনসুর আলী খান, জয়েদ আলী ও জয়েদ খানের 
            সহযোগিতায় ভালুকা বাজার সৃষ্টি হয়। পূর্ব বাজারে একটি কাঁচারী ঘর ছিলো। সেখানে ভাওয়াল রাজার নামে 
            খাজনা আদায় করা হতো। ভাওয়ালের কাঁচারীর নাম হয়ে ছিলো ভাওয়ালের নাম অনুসারেই। পরবর্তী সময় বাজারসহ 
            গ্রামের নামকরণ হয় ভালুকা।
          </p>

          <p><strong>তৃতীয় জনশ্রুতি:</strong> 
            ভালুক চাঁদ মন্ডল ছিলেন আদিবাসী কোচ বংশের সর্দার। ভালুক চাঁদ এর নামানুসারে ভালুকা নামের সৃষ্টি হয়েছে। 
            উথুরা ইউনিয়নে ও বর্তমান ডাকাতিয়া অঞ্চলে কোচ বংশের লোকজনের অধিবাস এখনো রয়েছে। উল্লেখ করা যেতে পারে 
            যে, বর্তমানে কোচ বংশের লোকজন বর্মণ পদবী ‘ধারণ করেছে।
          </p>` 
      },
      { 
        question: 'মুক্তিযুদ্ধে অবদান', 
        answer: ' মুক্তিযুদ্ধের সময় ১১ নাম্বার সেক্টরের অধীনে থাকা ভালুকা পাকিস্তানি দখল মুক্ত হয় ৮ ডিসেম্বর। ভালুকার মুক্তিযুদ্ধের ইতিহাসে যার ভূমিকা অন্যতম তিনি হলেন বীর মুক্তিযুদ্ধা মেজর আফসার উদ্দিন। তার পরিচালিত বাহিনীকে আফসার বাহিনী বলা হত। মেজর আফসারের বাহিনীতে সেনাবাহিনীর নিয়মানুযায়ী ৫টি ব্যাটেলিয়নে ২৫টি কোম্পানি গঠন করা হয়। প্রত্যেক কোম্পানিতে ৩টি প্লাটুন, প্রত্যেক প্লাটুনে ৩টি সেকশন এবং প্রত্যেক সেকশনে ১৫ জন করে মুক্তিযুদ্ধা ছিল। তৎকালীন রাজশাহী ইঞ্জিনিয়ারিং কলেজের ছাত্র সংসদের সহসভাপতি ছিলেন ভালুকার মোঃ আব্দুল মান্নান যিনি প্রথম ৩টি ৩০৩ রাইফেল জোগাড় করে মেজর আফসার উদ্দিনকে ট্রেনিং শুরু করতে অনুরোধ করেন এবং নিজেও সেই বাহিনীতে যোগ দেন। এই বাহিনীর উল্লেখযোগ্য যুদ্ধের মধ্যে অন্যতম হলো- বাটাজোর (১৪ আগস্ট), কাচিনা, ডাকাতিয়া, পাঁচগাঁও, কাতলামারি, রাজৈ, ফুলবাড়িয়া ও কালিয়াকৈর ইত্যাদি জায়গায় এ বাহিনী বিপুল বিক্রমে যুদ্ধ করে। তার মধ্যে অন্যতম হল ভাওয়ালিয়াবাজু যুদ্ধ। মেজর আফসার উদ্দিনের নেতৃত্বে ২৬ জুন ভালুকা থানায় এ যুদ্ধ সংগঠিত হয়। ৪৮ ঘণ্টা স্থায়ী ভাওয়ালিয়াবাজু যুদ্ধে ৫০ জন পাকসেনা খতম হয়। শহীদ হন আরেক বীর মুক্তিযুদ্ধা আবদুল মান্নান।' 
      },
      { 
        question: 'জনসংখ্যার উপাত্ত', 
        answer: 'মোট_জনসংখ্যা= ৩০৮,৭৫৮ জন (২০১১ সনের আদমশুমারী অনুযায়ী), পুরুষ= ১৫৮,০০৩জন, মহিলা= ১৫০৭৫৫ জন। মুসলিম=৯৪%, হিন্দু=৫%, অন্যান্য=১%। জনসংখ্যার প্রতি বর্গ কিলোমিটারে ৬৯৫ জন, মোট খানার সংখ্যা ৭২,০৬৯টি, বার্ষিক জনসংখ্যা বৃদ্ধির হার ১.৫৪% বর্তমানে (২০১৯) স্থানীয় ধারণা অনুযায়ী ভালুকায় বিশাল বহিরাগত জনসংখ্যাসহ ১৫ লক্ষাধিক মানুষ বসবাস করছে,এবং এ থেকে বর্তমান ২০১৯ এ ভালুকার জনসংখ্যার বিশালতা ধারণা করা যায়।' 
      },
      { 
        question: 'শিক্ষা', 
        answer: 'শিক্ষসার হার=৪৯.৮%। মোট সাক্ষর জ্ঞান সম্পন্ন জনগণ:১৭৯৮৬১। মোট প্রাথমিক বিদ্যালয় ২১৭টি (সরকারী ৯৪টি, বেসরকারী রেজিষ্টার্ড ৩৫টি, আন রেজিষ্টার্ড ১টি, উচ্চ বিদ্যালয় সংলগ্ন ৮টি, কিন্ডার গার্ডেন ৬টি, স্বতন্ত্র এবতেদায়ী মাদ্রাসা ১১টি, উচ্চ মাদ্রাসা সংলগ্ন ৩৭টি, কমিউনিটি ২৫টি), নিম্ন মাধ্যমিক বিদ্যালয় ১১টি, ৯ম শ্রেণীর অনুমতি প্রাপ্ত বিদ্যালয় ৭টি, মাধ্যমিক বিদ্যালয় ৩৩টি, স্কুল এন্ড কলেজ ৩টি, উচ্চ মাধ্যমিক বিদ্যালয় ১টি, ডিগ্রী কলেজ ২টি (সরকারী), ফাযিল মাদ্রাসা ৩টি, আলিম মাদ্রাসা ২টি, দাখিল মাদ্রাসা ৩৬টি।'
  
  
      },
      { 
        question: 'নির্বাচন সংক্রান্ত', 
        answer: 'নির্বাচনী এলাকা ১৫৬-ময়মনসিংহ ১১। ভোটার সংখ্যা পুরুষ ১১৪৪২২ জন, মহিলা ১১৯৩৯৭ জন, মোট ২৩৩৮১৯ জন। বর্তমান সংসদ সদস্য নেই সদ্য সাবেক সংসদ সদস্য এম এ ওয়াহেদ।' 
      },
      { 
        question: 'বিবিধ শিল্পাঞ্চল ও শিল্প', 
        answer: 'অসংখ্য টেক্সটাইল মিলস,ঔষধ কারখানা,কুমির খামার,সিরামিক শিল্প,স্পিনিং মিলস,কোমল পানীয় কারখানা,স্যালাইন কারখানা,ফিস ফিড,চালের মিল,মোটরযান কারখানা,গ্লাস কারখানা এবং দক্ষিণ ভালুকায় রয়েছে ভারী শিল্প ও আন্তর্জাতিক মানের পোশাক শিল্পাঞ্চল।' 
      },
      { 
        question: 'ভালুকার নদীসমূহ', 
        answer: 'নদী ভালুকা উপজেলায় অনেকগুলো নদী আছে। সেগুলো হচ্ছে খিরু নদী, সুতিয়া নদী, কাওরাইদ নদী, বাজুয়া নদী, লাউতি নদী,বিলাই জুড়ি ও মিয়াবুয়া নদী খিরু নদী ও ভালুকা শীতলক্ষার একটি শাখা নদী খিরু নদী। ভালুকা বাজারের পাশ দিয়ে বয়ে গেছে নদীটি। নদীটির দুই পাড়ের নৈসর্গিক দৃশ্য অনেক নয়নাভিরাম সৌন্দর্য দেখে মনপ্রাণ মুগ্ধ হয়ে যায়।এককালে ভাটি অঞ্চলের মানুষ বিশেষকরে বরমীবাজার,কাওরাইদ বাজার,পারুলদিয়া বাজার, ঝালপাজা বাজার,পনাশাইল বাজার,মল্লিকবাড়ী বাজার অনবরত যাতায়াত ছিল এইনদী পথে।সময়ের ব‍্যবধানে সেই জনপদগুলো আজ বিলুপ্তির দিকে।এইনদীর মাছ অনেক নদীর তুলনায় খেতে খুব সুস্বাদু ছিল। সারি সারি পালের নৌকায় মাঝির কন্ঠে ভাটিয়ালি শোনা যেত।নৌকা বাইচ ছিল খুব এই নদীতে জনপ্রিয়।প্রতি বর্ষায় আসর বসত উত্তেজনাপূর্ণ নৌকা বাইচের। বিভিন্ন জেলার বণিকদের যাতায়াতের পথ ছিল এই নদী।' 
      },
      { 
        question: 'প্রকৃতিক সম্পদ', 
        answer: 'কাদিগড় জাতীয় উদ্যান এই উপজেলায় অবস্থিত একটি জাতীয় উদ্যান। ২০১০ সালের ২৪ অক্টোবর এটি প্রতিষ্ঠিত হয়। ৩৪৪.১৩ হেক্টর জমি নিয়ে এই জাতীয় উদ্যানটি গঠিত।[৪] এছাড়া মোট বনভূমি ২৩০৭৮.২৬ একর। বালু মহল আছে।' 
      },
      { 
        question: 'কৃষি', 
        answer: 'মোট জমি ৪৪৪০৫ হেক্টর। এক ফসলী জমি ৫২২৩ হেক্টর, দুই ফসলী জমি ১৯৫৩৮ হেক্টর, তিন ফসলী জমি ১৬৮৯৭ হেক্টর। নীট ফসলী জমি ৪১৬৫৮ হেক্টর, মোট ফসলী জমি ৯৪৯৯০ হেক্টর, ফসলের নিবিড়তা ২২৮%। বর্গাচাষী ৮০০০ জন, প্রান্তিক চাষী ২৪০১১ জন, ক্ষুদ্র চাষী ৯০০০ জন, মাঝারি চাষী ৮৩২৮ জন, বড় চাষী ২০০০ জন। কৃষি ব্লকের সংখ্যা ৩১টি, কৃষি বিষয়ক পরামর্শ কেন্দ্র ৩১টি, সয়েল মিনিল্যাব ৫টি, বিএডিসি বীজ ডিলার ১৯ জন, বিসিআইসি সার ডিলার ১০ জন।' 
      },
      { 
        question: 'স্বাস্থ্য কেন্দ্র', 
        answer: 'আপনি সহজেই আমাদের ওয়েবসাইটে গিয়ে রেজিস্ট্রেশন ফর্ম পূরণ করতে পারেন।' 
      },
      { 
        question: 'জনসংখ্যার উপাত্ত', 
        answer: 'উপজেলা স্বাস্থ্য কমপ্লে­ক্স ১টি (৫০ শয্যাবিশিষ্ট), পরিবার কল্যাণ কেন্দ্র ৭টি, উপস্বাস্থ্য কেন্দ্র ৩টি, কমিউনিটি ক্লিনিক ২৬টি। সরকারী অ্যাম্বুলেন্স ১টি। এবং হবিরবাড়ী ইউনিয়ন পরিষদ চেয়ারম্যান দান করেছে ১টি অ্যাম্বুলেন্স।' 
      },
      { 
        question: 'রপ্তানিতে অবদান', 
        answer: 'বিসিক শিল্পাঞ্চল ভালুকায় অবস্থিত অসংখ্য গার্মেন্টস টেক্সটাইল ও বিভিন্ন শিল্পকারখানা থেকে তৈরি পোশাকসহ অসংখ্য পণ্য নিয়মিত বিদেশে রপ্তানি হচ্ছে,যা দেশের শিল্প খাতে ব্যাপক ভুমিকা রাখছে। দেশের বিভিন্ন জেলার লাখ লাখ জনগণের কর্মসংস্থান দিচ্ছে গার্মেন্টস ও টেক্সটাইল ফ্যাক্টরিগুলো। বানি্জ্যিকভাবে মাছ উৎপাদনে ভালুকার ব্যাপক সুনাম রয়েছে।পেশা হিসেবে অসংখ্য উদ্যোক্তা মাছ চাষকে বেছে নিয়েছেন। অধিকাংশ জলাশয়েই বাণিজ্যিক ভাবে মাছ চাষ হচ্ছে। রুই, কাতলা, পাঙাশ, তেলাপিয়া, কই, মাগুর ও শিং জাতের মাছ চাষ হচ্ছে বাণিজ্যিকভিত্তিতে।২০১৭-১৮ অর্থবছরে সারা দেশে মাছ উৎপাদিত হয়েছে ৪২ লাখ মেট্রিক টন এবং ময়মনসিংহ জেলায় মাছ উৎপাদন হয়েছে ৪ লাখ ৪৮ হাজার ৮৮২ মেট্রিক টন।সে মতে সারাদেশের মোট উৎপাদিত মাছের প্রায় ১০ ভাগ উৎপাদিত হয় ময়মনসিংহে,যা অর্জনে সবচেয়ে বেশি অবদান ভালুকার। ভালুকার হাতিবেড় গ্রামে দক্ষিণ এশিয়ার প্রথম কুমির প্রজনন খামার রেপটাইলস। ২০০৪ সালে মাত্র ৭৫টি কুমির দিয়ে খামারের যাত্রা শুরু,পরে কুমিরের ডিম থেকে কৃত্রিমভাবে বাচ্চা ফোটানো হয়। বর্তমানে এ খামারে কুমিরের সংখ্যা আড়াই হাজারের অধিক।জাপান (২০১৪, ১৫ ও ১৬ সালে) ও জার্মানিতে (২০১০ সালে) মোট চারবার জ্যান্ত কুমির এবং চামড়া রপ্তানি করেছে। বাংলাদেশ থেকে প্রথমবার এই ফার্ম থেকেই কুমিরের মাংস, চামড়া, দাঁত ও হাড় রপ্তানি করে প্রায় পাঁচ কোটি টাকা আয় হয়েছে। বর্তমানে প্রতি বছর প্রচুর কুমির রপ্তানি হচ্ছে। কৃষির আধুনিকায়নের ছোয়ায় প্রচলিত চাষাবাদের সাথেও ভালুকার গ্রামাঞ্চলে অনেক উদ্যোক্তা নতুন ধারায় চাষাবাদ করছেন। বানিজ্যিকভাবে খামার,ফলের বাগান, ফুলের বাগানে শিক্ষিত উদ্যোক্তাদের পদচারণা।' 
      },
      { 
        question: 'বিনোদন ও খেলাধুলা', 
        answer: 'বিনোদন ভালুকায় রয়েছে কাদিগড় জাতীয় উদ্যান, তেপান্তর সুটিং স্পট, ড্রীম ওয়াল্ড পার্ক & রিসোর্ট, গ্রীণ অরণ্য পার্ক, কুমির খামার, মোতালেবের সৌদিয়া খেজুর বাগান। খেলাধুলা ক্রিকেট, ফুটবল, কাবাডি, এক্কাদোক্কা, দাড়িয়াবান্ধা, গোল্লাছুট, কানামাছি, বউচি, দাবা ইত্যাদি। সংস্কৃতি[সম্পাদনা] মৈমনসিংহ গীতিকা, ফকিরি গান (জনপ্রিয়), বাউল গান, যাত্রা ইত্যাদি।' 
      },

    // other items...
  ];

  const containerStyle = {
    maxWidth: '90%',
    margin: '10px  10px 10px 10px',
    padding: '11px',
    backgroundColor: '#f9f9f9',
    borderRadius: '8px',
  };

  const headerStyle = {
    fontSize: '.9rem',
    color: '#333',
    marginBottom: '10px',
    textAlign: 'center',
  };

  const accordionStyle = {
    marginBottom: '10px',
    borderRadius: '8px',
    boxShadow: '0 2px 5px rgba(0, 0, 0, 0.1)',
  };

  const accordionItemStyle = {
    marginBottom: '5px',
    backgroundColor: '#ffffff',
    border: '1px solid #e1e1e1',
    borderRadius: '8px',
  };

  const accordionHeaderStyle = {
    fontSize: '1..9rem',
    fontWeight: 'bold',
    padding: '5px',
    backgroundColor: '#4caf50',
    color: '#fff',
    cursor: 'pointer',
  };

  const accordionBodyStyle = {
    padding: '5px',
    backgroundColor: '#f1f1f1',
    fontSize: '1rem',
    color: '#555',
    borderTop: '1px solid #e1e1e1',
  };

  return (
    <div style={containerStyle}>
      <h2 style={headerStyle}>সাধারণ প্রশ্নোত্তর (FAQ)</h2>
      <h1>ভালুকা উপজেলার পরিচিতি</h1>
      <p>ভালুকা বাংলাদেশের ময়মনসিংহ জেলার অন্তর্গত একটি উপজেলা। এটি বাংলাদেশের প্রথম মডেল থানা এবং দেশের অন্যতম বিসিক শিল্প নগরী। সাক্ষরতার হার 96% বেকারত্বের হার 4% শিক্ষার হার 72% প্রবাসী রেমিটেন্স 7% এটি সারা বাংলাদেশের সবকয়টা থানাকে পিছনে ফেলে ভালুকা এক নম্বর অবস্থানে এসেছে। ইসলাম 95% হিন্দু 3% খ্রিস্টান 2% এ উপজেলায় ৮৭টি মৌজা ও ১১০টি গ্রাম রয়েছে। নিচের ছবির মাধ্যমে <mark>ভালুকা উপজেলার ম্যাপ দেখানো হলো।</mark></p>
      <img src={ugijk} width="90%" height="auto" style={{ border: 0 }} loading="lazy" alt="Description of the image" />
      <Accordion activeKey={activeKey} onSelect={(key) => setActiveKey(key)} style={accordionStyle}>
        {faqItems.map((item, index) => (
          <Accordion.Item eventKey={String(index)} key={index} style={accordionItemStyle}>
            <Accordion.Header style={accordionHeaderStyle}>{item.question}</Accordion.Header>
            <Accordion.Body style={accordionBodyStyle}>
              <div dangerouslySetInnerHTML={{ __html: item.answer }} />
            </Accordion.Body>
          </Accordion.Item>
        ))}
      </Accordion>
    </div>
  );
};

export default Bhaluka_Upazila;
