import React from 'react';
import jhkufvdsx from "../Images/i.png";

const ProfileImage = () => {
  const imageStyle = {
    width: '150px',
    height: '150px',
    borderRadius: '50%',
    objectFit: 'cover',
    marginBottom: '15px',
  };

  return <img src={jhkufvdsx} alt="Profile" style={imageStyle} />;
};

const ProfileDetails = ({ name, mobile, email, location }) => {
  const headingStyle = {
    fontSize: '1.5em',
    fontWeight: 'bold',
    color: '#333',
    marginBottom: '10px',
  };

  const textStyle = {
    fontSize: '1em',
    color: '#666',
    marginBottom: '8px',
  };

  return (
    <>
      <div style={headingStyle}>{name}</div>
      <div style={textStyle}>Mobile: {mobile}</div>
      <div style={textStyle}>Location: {location}</div>
      <div style={textStyle}>Email: {email}</div>
    </>
  );
};

const ProfileCard = ({ name, mobile, email, location }) => {
  const cardStyle = {
    display: 'flex',
    flexDirection: 'column',
    alignItems: 'center',
    border: '1px solid #ddd',
    borderRadius: '10px',
    padding: '20px',
    width: '300px',
    boxShadow: '0 4px 6px rgba(0, 0, 0, 0.1)',
    backgroundColor: '#f9f9f9',
    fontFamily: 'Arial, sans-serif',
    margin: '10px',
  };

  return (
    <div style={cardStyle}>
      <ProfileImage />
      <ProfileDetails name={name} mobile={mobile} location={location} email={email}  />
    </div>
  );
}; 

const Famous_person = () => {
  const profiles = [
    { name: 'ভাষা সৈনিক মোস্তফা এমএ মতিন', mobile: '০১৭১৩৩৭৩৪৪১', email: 'john.doe1@example.com', location: 'মতিন ১ আগস্ট ১৯৩৪ সালে ময়মনসিংহের ভালুকার সাতেঙ্গা গ্রামে জন্মগ্রহণ করেন। তার পিতার নাম তাহের উদ্দিন শেখ এবং মাতা হাজেরা খাতুন। ৪ ভাই ২ বোনের মধ্যে মোস্তফা মতিন চতুর্থ। তিনি মা-বাবার কনিষ্ঠ পুত্র আবদুল মতিন ১৯৫০ সালে গফরগাঁও ইসলামিয়া সরকারি হাই স্কুল থেকে প্রথম বিভাগে ম্যাট্রিক ও ১৯৫২ সালে ঢাকা কলেজ থেকে প্রথম বিভাগে আইএ পাস করেন। জগন্নাথ কলেজ থেকে বি.এ এবং ঢাকা বিশ্ববিদ্যালয় থেকে এল.এল.বি. ডিগ্রী অর্জন করেন। ১৯৬৩ সালে ঢাকা জেলা বারে আইন পেশায় যোগদান করেন মতিন বাংলাদেশ স্বাধীনতা লাভের পর ময়মনসিংহ জেলা আইনজীবী সমিতিতে যোগদান করে আমৃত্যু আইন পেশায় নিয়োজিত ছিলেন। এর পূর্বে মতিঝিল টি এন্ড টি হাই স্কুলে সহকারী প্রধান শিক্ষক হিসেবে কর্মরত ছিলেন। তিনি ছাত্রাবস্থাতে রাজনীতে যুক্ত হন এবং বাংলাদেশ আওয়ামী লীগের রাজনীতির সাথে যুক্ত ছিলেন। তিনি বাংলা ভাষা আন্দোলন থেকে শুরু করে বাংলাদেশের স্বাধীনতা যুদ্ধসহ সকল আন্দোলনে সক্রিয়ভাবে অংশ নেন। মতিন ১৯৭০ সালে প্রাদেশিক পরিষদ ও ১৯৭৩ সালে বিলুপ্ত ময়মনসিংহ-১৮ আসন (বর্তমান ময়মনসিংহ-১১) থেকে সংসদ সদস্য নির্বাচিত হন। ১৯৯১ সালের পঞ্চম জাতীয় নির্বাচনে তিনি ময়মনসিংহ-১১ আসন থেকে অংশ নিয়ে পরাজিত হয়েহিলেন। তিনি মুক্তিযুদ্ধ চলাকালীন প্রবাসী সরকারের স্বাধীন বাংলা ফুটবল দলের প্রতিষ্ঠাতা পরিচালক হিসেবে সরকারের অর্থনৈতিক সহায়তায় গুরুত্বপূর্ণ ভূমিকা রাখেন। ময়মনসিংহ জেলা আইনজীবী সমিতির নির্বাচিত সভাপতি হিসেবে দুই মেয়াদে (২০০১ ও ২০০২) দায়িত্ব পালন করেন।  ১৯৫২ সালে বাংলা ভাষা আন্দোলনে অংশগ্রহণের স্বীকৃতিস্বরুপ ময়মনসিংহ জেলা প্রশাসনের উদ্যোগে ২০০০ সালে মতিনকে ভাষা সৈনিক হিসেবে সংবর্ধনা ও স্বর্ণপদক প্রদান করা হয়। ভাষা সৈনিক মোস্তফা এম এ মতিন স্বরনে ময়মনসিংহ জয়নুল আবেদীন পার্কে ভাষা সৈনিক এডভোকেট মোস্তফা এম.এ. মতিন পৌর পাঠাগার স্থাপন করা হয়।' },
    { name: 'মরহুম আফতাব উদ্দিন চৌধুরী', mobile: '01733-338958', email: 'john.doe2@example.com', location: ' আফতাব উদ্দিন চৌধুরী : আফতাব উদ্দিন চৌধুরী ১ মার্চ ১৯১২ সালে ময়মনসিংহ বাঙালি মুসলিম জমিদারী পরিবারে জন্মগ্রহণ করেন। খান আবেদ উল্যাহ চৌধুরী ও হালিমুন্নেছা চৌধুরানী একমাত্র পুত্র তিনি।আফতাব উদ্দিন চৌধুরীর সন্তান আমান উল্লাহ চৌধুরী ছিলেন ময়মনসিংহ-১১ আসনের সংসদ সদস্য ও প্রতিমন্ত্রী।আফতাব ১৯৪৮ সালে ভালুকা পাইলট উচ্চ বিদ্যালয়ের প্রতিষ্ঠাতা করেন।আফতাব উদ্দিন চৌধুরী কেন্দ্রীয় মুসলিম লীগের সহ সভাপতি ও কূটনীতিক ছিলেন। তিনি ১৯৬৫ থেকে ১৯৬৯ সাল পর্যন্ত পাকিস্তানের ৪র্থ জাতীয় পরিষদের সদস্য (এম এন এ) ছিলেন। চৌধুরীর প্রস্তাবে ঢাকা-ময়মনসিংহ মহাসড়কটি আইয়ুব খানের শাসনামলে নির্মিত হয়।তিনি ১৯৭৯ সালের দ্বিতীয় জাতীয় সংসদ নির্বাচনে বাংলাদেশ মুসলিম লীগের মনোনয়ন নিয়ে ময়মনসিংহ-১০ আসন থেকে সংসদ সদস্য নির্বাচিত হয়ে ছিলেন।আফতাব উদ্দিন চৌধুরী ২৪ জুলাই ১৯৮৫ সালে মৃত্যুবরণ করেন। ' },
    { name: 'অধ্যাপক ডা: এম. আমান উল্লাহ', mobile: '০১৩২০১০৩২৯৬', email: 'john.doe3@example.com', location: '“অধ্যাপক ডা: এম. আমান উল্লাহ স্যার ”উপমহাদেশের প্রখ্যাত হৃদরোগ বিশেষজ্ঞ ছিলেন। অধ্যাপক ডা: এম. আমান উল্লাহ ১৯৩৯ইং সালের ১৬ই মার্চ মাসে ময়মনসিংহ জেলার ভালুকা থানার মাহমুদপুর গ্রামে এক সম্ভান্ত মুসলিম পরিবারে জন্ম গ্রহণ করেন । তাঁর পিতা মরহুম ডা: এম সাফায়েত উল্লাহ এবং মাতা মরহুমা সায়েরা খাতুন। তাঁর দাদা মরহুম নুর মোহাম্ম্দ সরকার তৎকালীন মুক্তাগাছা জমিদারের নায়েব ছিলেন এবং তাঁর দাদী মরহুমা মরিয়ম আক্তার গ্রামের মহিলাদের কোরআন শিক্ষা দিতেন। অধ্যাপক ডা: এম, আমান উল্লাহ সরকারী বৃত্তিসহ প্রাথমিক পাশ, Middle English Exam পাস করে ১৯৫৫ সনে দুইটি লেটার সহ ম্যাট্রিকুলেশন ও ১৯৫৭ সনে প্রথম বিভাগে আই,এস,সি পরীক্ষায় পাস করেন এবং ১৯৬৩ সনে ঢাকা মেডিক্যাল কলেজ হতে কৃতিত্বের সাথে M.B.B.S. ডিগ্রী লাভ করেন। ঢাকা মেডিক্যাল কলেজ হাসপাতালের ইন্টারনীশীপ সমাপ্ত করে ১৯৬৪ সালে তিনি মেডিসিন ও কার্ডিওলজি চাকুরি জীবন আরম্ভ করেন। ' },
    { name: 'কেবিএম আছমত আলী সরকার', mobile: '০১৩২০১০৩২৯৬', email: 'john.doe3@example.com', location: 'ভালুকা মডেল থানা পুলিশ' },
    { name: 'মেজর আফসার উদ্দিন', mobile: '০১৩২০১০৩২৯৬', email: 'john.doe3@example.com', location: 'কেবিএম আছমত আলী সরকার ১৯৩৫ সালে বৃহত্তর ময়মনসিংহ জেলার তৎকালীন গফরগাঁও (বর্তমান ভালুকা ) থানার খিরু নদীর অববাহিকায় অবস্থিত খারুয়ালী গ্রামের সরকার বাড়িতে জন্ম গ্রহণ করেন। তাঁর পিতা: মরহুম জবান আলী সরকার, মাতা:মরহুমা কলিমুন নেচ্ছা। চার ভাই ৬ বোনের মধ‍্যে তিনি ছিলেন জ‍্যেষ্ঠ। রাজনৈতিক জীবন: শৈশব থেকেই রাজনীতি সচেতন আছমত আলী ছিলেন হোসেন শহীদ সোহরাওয়ার্দী ও শেরেবাংলা একে ফজলুল হকের ভীষণ ভক্ত। ছাত্রাবস্থায় আওয়ামী মুসলিম লীগের প্রতি তিনি অনুরক্ত হয়ে পড়েন। তরুণ বঙ্গবন্ধুর বলিষ্ঠ ব‍্যক্তিত্বে আকৃষ্ট হয়ে তিনি আওয়ামী মুসলিম লীগ পরবর্তীকালে আওয়ামীলীগের রাজনীতিতে সম্পৃক্ত হন। ছাত্রাবস্থায়ই তিনি বিভিন্ন সভাসমাবেশে নেতৃত্ব দিতে থাকেন। ১৯৫২ সালের ভাষা আন্দোলনের পক্ষে কাজ করেন ।এরপর ১৯৫৪ এর যুক্তফ্রন্ট নির্বাচন,১৯৫৮ এর ১৯৬২ র শিক্ষা আন্দোলন, ১৯৬৬ এর ছয়দফা আন্দোলন, ১৯৬৯ এর গণআন্দোলনে (গণঅভ‍্যূত্থান ) যোগ দিয়ে নিজেকে রাজনৈতিক প্রজ্ঞায় ঋদ্ধ করেন, এবং ভালুকার তারু চেয়ারম্যানের বাড়ী আগুনে পুড়ানোর মিথ্যা মামলার প্রধান আসামী ছিলেন এ কেবিএম আছমত আলী। উক্ত সময় দীর্ঘ ২ বছর তিনি ঢাকায় বঙ্গবন্ধু শেখ মুজিবর রহমানের ৩২ নাম্বার ধানমন্ডি বাড়ীতেই ছিলেন। ' },
    { name: 'অধ্যাপক ডা.আমান উল্যাহ চৌধুরী', mobile: '০১৩২০১০৩২৯৬', email: 'john.doe3@example.com', location: 'আমান উল্লাহ চৌধুরী ময়মনসিংহ জেলার ভালুকা উপজেলায় জন্মগ্রহণ করেন। তার পিতা আফতাব উদ্দিন চৌধুরী তৎকালীন ময়মনসিংহ-১০ আসনের সংসদ সদস্য ও পাকিস্তান জাতীয় পরিষদের সদস্য (এম এন এ) ছিলেন। আমান উল্লাহ চৌধুরী ১৩ ফেব্রুয়ারি ১৯৬৬ সালে মানিকগঞ্জ জেলার রাহিজা খানম ঝুনুকে বিয়ে করেন। দুই মেয়ে লোপা ও ফারহানা চৌধুরী বেবী । দুজনই নৃত্যশিল্পী। ১৯৯০ সালে লোপা মারা যান। দুই ছেলে আহসান ও আহসান উল্লাহ চৌধুরী। ' },
    // আপনি এখানে নাম এবং মোবাইল নাম্বারগুলো যোগ করতে পারবেন।
  ];

  return (
    <div style={{ display: 'flex', flexWrap: 'wrap', justifyContent: 'center' }}>
      {profiles.map((profile, index) => (
        <ProfileCard
          key={index}
          name={profile.name}
          mobile={profile.mobile}
          location={profile.location}
          email={profile.email}
        />
      ))}
    </div>
  );
};

export default Famous_person;
